[
  {
    "id": "CVE-1999-0096",
    "year": 1999,
    "title": "Melissa Virus",
    "summary": "A macro virus that spread rapidly via email, targeting Microsoft Word and Outlook. It automatically forwarded itself to the first 50 contacts in a user's address book, causing significant network traffic and disruption.",
    "details_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-1999-0096" 
  },
  {
    "id": "CVE-2000-0884",
    "year": 2000,
    "title": "ILOVEYOU Worm (Love Bug)",
    "summary": "A highly destructive worm that spread via email attachments disguised as a love letter. It overwrote files, stole passwords, and forwarded itself to all contacts in the user's Outlook address book, causing billions in damages.",
    "details_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2000-0884"
  },
  {
    "id": "CVE-2001-0500",
    "year": 2001,
    "title": "Code Red Worm",
    "summary": "Exploited a buffer overflow vulnerability in Microsoft IIS web servers. It defaced websites and launched denial-of-service (DoS) attacks, showcasing the vulnerability of web infrastructure running on Windows.",
    "details_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2001-0500"
  },
  {
    "id": "CVE-2003-0070",
    "year": 2003,
    "title": "SQL Slammer Worm",
    "summary": "A fast-spreading worm that exploited a buffer overflow vulnerability in Microsoft SQL Server. It caused widespread network outages and disruption, particularly affecting internet infrastructure.",
    "details_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2003-0070"
  },
  {
    "id": "CVE-2004-0207",
    "year": 2004,
    "title": "Sasser Worm",
    "summary": "Exploited a vulnerability in the Microsoft Windows LSASS service, leading to system crashes and reboots. It spread rapidly without user interaction, highlighting the danger of unpatched systems.",
    "details_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2004-0207"
  },
  {
    "id": "CVE-2008-4250",
    "year": 2008,
    "title": "Conficker Worm",
    "summary": "One of the most destructive and long-lasting worms, it exploited a vulnerability in the Server Service. It created botnets, downloaded malware, and disabled security software, infecting millions of Windows devices globally.",
    "details_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2008-4250"
  },
  {
    "id": "CVE-2010-2568",
    "year": 2010,
    "title": "Stuxnet",
    "summary": "A sophisticated nation-state-sponsored worm that targeted industrial control systems (ICS), specifically Siemens PLCs, often found in Windows environments. It highlighted the potential for cyber warfare and the intersection of IT and OT security.",
    "details_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2010-2568" 
  },
  {
    "id": "CVE-2013-3900",
    "year": 2013,
    "title": "CryptoLocker Ransomware",
    "summary": "One of the early and highly impactful ransomware variants. It encrypted user files and demanded a ransom, often spread through phishing emails. This marked a significant shift in malware's monetization strategy.",
    "details_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2013-3900" 
  },
  {
    "id": "CVE-2017-0144",
    "year": 2017,
    "title": "WannaCry Ransomware",
    "summary": "Exploited the 'EternalBlue' vulnerability (leaked NSA exploit) in Microsoft's Server Message Block (SMB) protocol. It caused a global ransomware epidemic, affecting hundreds of thousands of computers, including critical infrastructure like the UK's NHS.",
    "details_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2017-0144"
  },
  {
    "id": "CVE-2017-0145",
    "year": 2017,
    "title": "NotPetya Ransomware (Wiper)",
    "summary": "Initially disguised as ransomware, NotPetya was a destructive wiper that used similar exploits to WannaCry (EternalBlue) to propagate. It caused massive economic damage by destroying data across numerous organizations globally.",
    "details_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2017-0145"
  },
  {
    "id": "CVE-2020-0796",
    "year": 2020,
    "title": "SMBGhost (EternalDarkness)",
    "summary": "A critical remote code execution vulnerability in the SMBv3 protocol that could allow an unauthenticated attacker to execute arbitrary code on a vulnerable server or client. Dubbed 'SMBGhost' due to its similarity to EternalBlue.",
    "details_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2020-0796"
  },
  {
    "id": "CVE-2020-1472",
    "year": 2020,
    "title": "Zerologon",
    "summary": "A critical privilege escalation vulnerability in the Netlogon Remote Protocol (MS-NRPC) that allowed an unauthenticated attacker to gain full domain administrator privileges over a Windows domain controller.",
    "details_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2020-1472"
  },
  {
    "id": "CVE-2020-16996",
    "year": 2020,
    "title": "SolarWinds Supply Chain Attack (SUNBURST)",
    "summary": "While not solely a Windows vulnerability, this attack heavily impacted Windows environments. Threat actors compromised the SolarWinds Orion software update mechanism to distribute malware, gaining access to numerous government agencies and private companies worldwide.",
    "details_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2020-16996" 
  },
  {
    "id": "CVE-2021-26855",
    "year": 2021,
    "title": "Microsoft Exchange Server Vulnerabilities (Hafnium)",
    "summary": "A series of zero-day vulnerabilities in on-premises Microsoft Exchange Servers actively exploited by a Chinese state-sponsored group (Hafnium). These vulnerabilities allowed for remote code execution and data exfiltration, leading to widespread compromises of email systems globally.",
    "details_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2021-26855"
  },
  {
    "id": "CVE-2022-26925",
    "year": 2022,
    "title": "Windows LSA Spoofing Vulnerability (PetitPotam)",
    "summary": "A vulnerability that allows attackers to force domain controllers to authenticate to malicious servers using NTLM, potentially leading to NTLM relay attacks and privilege escalation.",
    "details_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2022-26925"
  },
  {
    "id": "CVE-2023-35628",
    "year": 2023,
    "title": "Microsoft Outlook Elevation of Privilege Vulnerability",
    "summary": "A vulnerability that could allow an attacker to gain elevated privileges if they successfully exploit a flaw in how Outlook handles certain files. Often used in phishing campaigns.",
    "details_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-35628"
  },
  {
    "id": "CVE-2023-34362",
    "year": 2023,
    "title": "MOVEit Transfer SQL Injection Vulnerability",
    "summary": "While not directly a Windows vulnerability, this critical SQL injection flaw in the MOVEit Transfer application (often deployed on Windows servers) led to widespread data breaches for organizations globally, highlighting the supply chain risk in software.",
    "details_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2023-34362"
  },
  {
    "id": "CVE-2024-21318",
    "year": 2024,
    "title": "Microsoft Exchange Server Remote Code Execution Vulnerability",
    "summary": "A critical vulnerability affecting Microsoft Exchange Server that could allow an authenticated attacker to perform remote code execution. This highlights the ongoing need for vigilant patching and security best practices for on-premise Exchange.",
    "details_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-21318"
  },
  {
    "id": "NOBELIUM-2024",
    "year": 2024,
    "title": "Midnight Blizzard Microsoft Corporate Network Breach",
    "summary": "The Russian state-sponsored threat actor Midnight Blizzard (NOBELIUM) gained unauthorized access to Microsoft's corporate network, including email accounts of senior leadership, security, and legal teams, through a password spray attack on a legacy test tenant account. This demonstrated persistence and exploitation of weak links in an otherwise robust security posture.",
    "details_url": "https://www.microsoft.com/en-us/security/blog/2024/01/25/midnight-blizzard-guidance-for-responders-on-nation-state-attack/" 
  },
  {
    "id": "CVE-2024-21416",
    "year": 2024,
    "title": "Windows TCP/IP Remote Code Execution Vulnerability",
    "summary": "A critical remote code execution vulnerability in the Windows TCP/IP stack that could allow an attacker to execute arbitrary code on affected systems without user interaction. This highlights the importance of patching core networking components.",
    "details_url": "https://cve.mitre.org/cgi-bin/cvename.cgi?name=CVE-2024-21416"
  },
  {
    "id": "CROWDSTRIKE-OUTAGE-2024-07",
    "year": 2024,
    "title": "CrowdStrike Falcon Sensor Outage",
    "summary": "A faulty update to CrowdStrike's Falcon Sensor security software caused widespread Blue Screens of Death and system crashes on Windows machines globally, impacting critical services in various industries. While not a direct Windows vulnerability, it exposed the significant impact of third-party security software on Windows operational stability.",
    "details_url": "https://en.wikipedia.org/wiki/2024_CrowdStrike-related_IT_outages"
  }
]
